Tekla Open API Reference for Tekla Structures 2025
Model.GetClashCheckHandler Method
 Returns a new clash check handler.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ClashCheckHandler GetClashCheckHandler()
Public Function GetClashCheckHandler As ClashCheckHandler
Return Value
Type: ClashCheckHandler
The new clash check handler instance.
See Also
Reference
Model Class
Tekla.Structures.Model Namespace